In [8]:
import numpy as np

In [9]:
import pandas as pd

## 예제 1-10 내부 원소 처리 기준

In [2]:
#1~10까지의 임의의 수를 3*3 배열에 생성한다.

In [3]:
np.random.randint(1,10, (3,3))

array([[2, 2, 4],
       [3, 8, 8],
       [1, 2, 8]])

In [11]:
df_1 = pd.DataFrame(np.random.randint(1,10,(3,3)), columns=list('ABC'))

In [12]:
df_1

   A  B  C
0  2  5  1
1  8  6  7
2  2  1  2

In [13]:
df_2 = pd.DataFrame(np.random.randint(1,10,(3,3)), columns=list('ABC'))

In [14]:
df_2

   A  B  C
0  2  8  1
1  4  8  5
2  1  6  9

In [15]:
# 현재의 프레임은 유지되면서 각종 연산함수의 값이 각각의 원소에 업데이트 된다.

In [16]:
np.log(df_2)

          A         B         C
0  0.693147  2.079442  0.000000
1  1.386294  2.079442  1.609438
2  0.000000  1.791759  2.197225

In [17]:
# 열을 맞추어 계산한다.

In [18]:
df_1 + df_2

    A   B   C
0   4  13   2
1  12  14  12
2   3   7  11

In [20]:
df_3 = pd.DataFrame(np.random.randint(1,10,(3,2)), columns=list('CB'))

In [21]:
df_3

   C  B
0  8  5
1  3  6
2  4  7

In [22]:
df_1 + df_3

    A   B   C
0 NaN  10   9
1 NaN  12  10
2 NaN   8   6